---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NumberSystemOrientation
source: html/fd9030bb-cdeb-4862-404d-1efe46f56a61.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NumberSystemOrientation Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId NumberSystemOrientation { get; }
```